Practicas/PracticasGretl/Lecc02.org
#+title:  Lección 2
#+author: Marcos Bujosa
#+STARTUP: show4levels
#+LANGUAGE: es-es

#+EXPORT_FILE_NAME: pub/Lecc02

# +OPTIONS: toc:nil
#+OPTIONS: tags:nil

#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LaTeX_HEADER: \usepackage[svgnames,x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
#+LaTeX_HEADER: \PassOptionsToPackage{hyphens}{url}
# +LaTeX_HEADER: \input{notacionLinAlg.tex}
#+LaTeX_HEADER: \usepackage{nacal}

#+LaTeX_HEADER: \usepackage{framed}

#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \input{hansl.tex}
#+LaTeX_HEADER: \lstnewenvironment{hansl-gretl}
#+LaTeX_HEADER: {\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LaTeX_HEADER: \newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{white},basicstyle=\ttfamily\footnotesize,breaklines=true, captionpos=b,commentstyle=\color{mygreen},escapeinside={\%*}{*)}, keywordstyle=\color{blue},stringstyle=\color{mymauve}, }
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20},basicstyle=\ttfamily\footnotesize,breaklines=true, }
#+LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20}, }

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src

# \lstnewenvironment{code}
#     {\lstset{language=haskell,
#     basicstyle=\small\ttfamily,
#     numbers=left,
#     numberstyle=\tiny\color{gray},
#     backgroundcolor=\color{lightgray},
#     firstnumber=auto
#     }}
#     {}

#+bibliography: ref.bib

#+latex: \clearpage

# Guión abreviado al que se accede en ocasiones desde los apuntes
#+begin_src hansl :noweb tangle :tangle ./pub/scripts/EjPvivienda2.inp :exports none
<<Lectura del fichero de datos>>
<<Guardamos scatterplot como icono>>
<<Ajuste MCO que se guarda como icono>>
<<Mostramos la ventana del ajuste MCO>>
<<Guardamos las series de valores ajustados y de errores>>
print -o price sqft phat ehat
#+end_src


* Precio de casas unifamiliares
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/EjPvivienda.inp
   :END:

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/EjPvivienda.inp][EjPvivienda.inp]] |
   
En esta primera práctica con [[https://gretl.sourceforge.net/es.html][Gretl]] reproduciremos el ejemplo visto
repetidamente en clase. Los datos corresponden a los precios de venta y
superficie útil de 14 casas unifamiliares en /University City/. San
Diego, California. Año 1990. [cite:@Ramanathan:IEA-02]

Veremos como mostrar los datos, generar diagramas de dispersión,
realizar un ajuste por MCO, y operar con series de datos y con
parámetros estimados. Al final de la práctica aparece el guión
completo con el código que evita trabajar con los menús en modo
gráfico (que es el peor modo de trabajar con Gretl).


***** Objetivo
1. Reproducir el primer ejemplo de regresión visto en clase.

2. Mostrar datos.
3. Generar gráficos.
4. Guardar un modelo para poder consultarlo más tarde.
5. Recuperar valores ajustados, errores estimados, etc.

***** Carga de datos
*/~Archivo --> Abrir datos --> Archivo de muestra~/* y en la pestaña
*/~Ramanathan~/* seleccione =data3-1=.

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
#+NAME: Lectura del fichero de datos
#+begin_src hansl 
open data3-1
#+end_src
#+latex: }

** Actividad 1 - mostrar datos
***** Visualice los datos de precios y tamaños de las casas
- En la ventana principal de [[https://gretl.sourceforge.net/es.html][Gretl]], marque con el ratón ambas
  variables: =price=, =sqrt=.
- ``Pinche'' sobre ellas con el botón derecho del ratón.
- Seleccione */~mostrar valores~/* del menú desplegable que se ha
  abierto al pinchar.
  
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Mostramos los valores de los datos en columna
    #+begin_src hansl 
    print -o price sqft
    #+end_src
  #+latex: }

#+latex: \vspace{-3pt}   
  
***** Ayuda
Para consultar la documentación sobre cualquier comando, puede emplear
el menú desplegable */~Ayuda~/* que aparece arriba, a la derecha de la
ventana principal de [[https://gretl.sourceforge.net/es.html][Gretl]].
  + */~Ayuda -> Guía de Instrucciones~/* y ``pinche'' sobre */~print~/*

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/: =help print=
#+latex: }
    
** Actividad 2 - diagrama de dispersión
***** Scatter plot
- Marque =price= y =sqrt= (pulsando ~ctrl~ y pinchando con el botón
  derecho del ratón sobre ellas). Elija */~Gráfico de dos variables
  XY~/*
- Seleccione =sqft= como variable del eje X

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/: =gnuplot price sqft=
  #+latex: }

***** Guardar gráfico como /icono/ para editarlo más tarde
- ``Pinche'' con el botón derecho sobre la ventana del gráfico.
- Seleccione */~Guardar a sesión como icono~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Guardamos scatterplot como icono
    #+begin_src hansl 
    RectaDeRegresion <- gnuplot price sqft
    #+end_src
    (=RectaDeRegresion= /es el nombre con el que se guardará el icono/)
  #+latex: }

En la zona inferior izquierda de la ventana principal puede ver una
serie de iconos. Uno de ellos es la */~vista de iconos de sesión~/*.

** Actividad 3 - Ajuste por MCO

***** Ajuste por MCO el modelo de regresión visto en clase
#+ATTR_BEAMER: :overlay <+->
- Estime el modelo mediante los menús desplegables: */~Modelo ->
  Mínimos Cuadrados Ordinarios~/*; indique a [[https://gretl.sourceforge.net/es.html][Gretl]] el regresando y los
  regresores y pulse */~Aceptar~/*.
  
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl
    ols price 0 sqft
    #+end_src
    (/el cero/ =0= /indica el término constante/: =const=)
  #+latex: }
  
- ``Pinche'' */~Archivo~/* en la ventana del modelo estimado y
  seleccione */~guardar como un icono y cerrar~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Ajuste MCO que se guarda como icono
    #+begin_src hansl 
    Regresion  <- ols price 0 sqft
    #+end_src
  #+latex: }
    
- Recupere el modelo ``pinchando'' sobre su icono

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o teclee en linea de comandos el nombre que ha dado al icono
    seguido de/ =.show=, /es decir/:
    #+NAME: Mostramos la ventana del ajuste MCO
    #+begin_src hansl 
    Regresion.show
    #+end_src
  #+latex: }
  
** Actividad 4 - Recuperar los valores ajustados
***** Recuperemos los valores ajustados 
    :PROPERTIES:
    :BEAMER_ENV: block
    :BEAMER_ACT: <+->
    :END:
    
- Desde la ventana del modelo ajustado (recupérese con su icono),
  ``pinche'' en */~guardar -> valores estimados~/*. Elija como nombre
  =phat= (puede añadir una descripción de la variable). Pulse en
  */~Aceptar~/*
- Repita para guardar los =residuos= con el nombre =ehat=
  
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Guardamos las series de valores ajustados y de errores
    #+begin_src hansl 
    series phat =  $yhat
    series ehat =  $uhat
    #+end_src
  #+latex: }
    
