Practicas/PracticasGretl/pub/Lecc02.tex
% Created 2023-11-02 jue 20:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 2}
\begin{document}

\maketitle
\tableofcontents

\clearpage
\section{Precio de casas unifamiliares}
\label{sec:org0eafe95}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/EjPvivienda.inp}{EjPvivienda.inp}\\[0pt]
\end{tabular}
\end{center}

En esta primera práctica con \href{https://gretl.sourceforge.net/es.html}{Gretl} reproduciremos el ejemplo visto
repetidamente en clase. Los datos corresponden a los precios de venta y
superficie útil de 14 casas unifamiliares en \emph{University City}. San
Diego, California. Año 1990. (Ramu Ramanathan, 2002)

Veremos como mostrar los datos, generar diagramas de dispersión,
realizar un ajuste por MCO, y operar con series de datos y con
parámetros estimados. Al final de la práctica aparece el guión
completo con el código que evita trabajar con los menús en modo
gráfico (que es el peor modo de trabajar con Gretl).


\begin{enumerate}
\item Objetivo
\label{sec:org7a81a57}
\begin{enumerate}
\item Reproducir el primer ejemplo de regresión visto en clase.

\item Mostrar datos.
\item Generar gráficos.
\item Guardar un modelo para poder consultarlo más tarde.
\item Recuperar valores ajustados, errores estimados, etc.
\end{enumerate}

\item Carga de datos
\label{sec:orgc67a109}
\textbf{\emph{\texttt{Archivo -{}-> Abrir datos -{}-> Archivo de muestra}}} y en la pestaña
\textbf{\emph{\texttt{Ramanathan}}} seleccione \texttt{data3-1}.

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
open data3-1
\end{verbatim}
}
\end{enumerate}

\subsection{Actividad 1 - mostrar datos}
\label{sec:org4003853}
\begin{enumerate}
\item Visualice los datos de precios y tamaños de las casas
\label{sec:org430cd84}
\begin{itemize}
\item En la ventana principal de \href{https://gretl.sourceforge.net/es.html}{Gretl}, marque con el ratón ambas
variables: \texttt{price}, \texttt{sqrt}.
\item ``Pinche'' sobre ellas con el botón derecho del ratón.
\item Seleccione \textbf{\emph{\texttt{mostrar valores}}} del menú desplegable que se ha
abierto al pinchar.

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
print -o price sqft
\end{verbatim}
}
\end{itemize}

\vspace{-3pt}

\item Ayuda
\label{sec:org1d38316}
Para consultar la documentación sobre cualquier comando, puede emplear
el menú desplegable \textbf{\emph{\texttt{Ayuda}}} que aparece arriba, a la derecha de la
ventana principal de \href{https://gretl.sourceforge.net/es.html}{Gretl}.
\begin{itemize}
\item \textbf{\emph{\texttt{Ayuda -> Guía de Instrucciones}}} y ``pinche'' sobre \textbf{\emph{\texttt{print}}}
\end{itemize}

{\vspace{0pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}: \texttt{help print}
}
\end{enumerate}

\subsection{Actividad 2 - diagrama de dispersión}
\label{sec:org805554b}
\begin{enumerate}
\item Scatter plot
\label{sec:org7382860}
\begin{itemize}
\item Marque \texttt{price} y \texttt{sqrt} (pulsando \texttt{ctrl} y pinchando con el botón
derecho del ratón sobre ellas). Elija \textbf{\emph{\texttt{Gráfico de dos variables
  XY}}}
\item Seleccione \texttt{sqft} como variable del eje X

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}: \texttt{gnuplot price sqft}
}
\end{itemize}

\item Guardar gráfico como \emph{icono} para editarlo más tarde
\label{sec:org4a6153b}
\begin{itemize}
\item ``Pinche'' con el botón derecho sobre la ventana del gráfico.
\item Seleccione \textbf{\emph{\texttt{Guardar a sesión como icono}}}

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
RectaDeRegresion <- gnuplot price sqft
\end{verbatim}
(\texttt{RectaDeRegresion} \emph{es el nombre con el que se guardará el icono})
}
\end{itemize}

En la zona inferior izquierda de la ventana principal puede ver una
serie de iconos. Uno de ellos es la \textbf{\emph{\texttt{vista de iconos de sesión}}}.
\end{enumerate}

\subsection{Actividad 3 - Ajuste por MCO}
\label{sec:org9bebcb7}

\begin{enumerate}
\item Ajuste por MCO el modelo de regresión visto en clase
\label{sec:org2b28d1b}
\begin{itemize}
\item Estime el modelo mediante los menús desplegables: \textbf{\emph{\texttt{Modelo ->
  Mínimos Cuadrados Ordinarios}}}; indique a \href{https://gretl.sourceforge.net/es.html}{Gretl} el regresando y los
regresores y pulse \textbf{\emph{\texttt{Aceptar}}}.

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
ols price 0 sqft
\end{verbatim}
(\emph{el cero} \texttt{0} \emph{indica el término constante}: \texttt{const})
}

\item ``Pinche'' \textbf{\emph{\texttt{Archivo}}} en la ventana del modelo estimado y
seleccione \textbf{\emph{\texttt{guardar como un icono y cerrar}}}

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
Regresion  <- ols price 0 sqft
\end{verbatim}
}

\item Recupere el modelo ``pinchando'' sobre su icono

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o teclee en linea de comandos el nombre que ha dado al icono
  seguido de} \texttt{.show}, \emph{es decir}:
\begin{verbatim}
Regresion.show
\end{verbatim}
}
\end{itemize}
\end{enumerate}

\subsection{Actividad 4 - Recuperar los valores ajustados}
\label{sec:orgfd6352e}
\begin{enumerate}
\item Recuperemos los valores ajustados
\label{sec:org7f2a2a4}
\begin{itemize}
\item Desde la ventana del modelo ajustado (recupérese con su icono),
``pinche'' en \textbf{\emph{\texttt{guardar -> valores estimados}}}. Elija como nombre
\texttt{phat} (puede añadir una descripción de la variable). Pulse en
\textbf{\emph{\texttt{Aceptar}}}
\item Repita para guardar los \texttt{residuos} con el nombre \texttt{ehat}

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
series phat =  $yhat
series ehat =  $uhat
\end{verbatim}
}
\end{itemize}
