Practicas/PracticasGretl/Lecc02.org
***** Mostremos las variables =price=, =sqft=, =phat= y =ehat=
    :PROPERTIES:
    :BEAMER_ENV: block
    :BEAMER_ACT: <2>
    :END:
#+ATTR_BEAMER: :overlay <+->
- Marque las 4 variables (~ctrl~ y ``pinchar'' con el botón derecho) y elija
  */~mostrar valores~/*
  
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/: 
    #+begin_src hansl 
    print -o price sqft phat ehat
    #+end_src
    #+latex: }

** Actividad 5 - Otras formas de recuperar el ajuste
#+ATTR_BEAMER: :overlay <+>
- =phat2=: restar a los precios los errores
  
  Desde la ventana del modelo: */~Guardar -> Definir una nueva
  variable~/* y teclee:
  =phat2 = price - ehat=
  
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Otras formas de calcular phat
    #+begin_src hansl 
    series phat2 = price - ehat
    #+end_src
  #+latex: }
    
- =phat2=: Cálculo /``chapucero''/: 52.351 + 0.139 /sqft/

  */~Guardar -> Definir una nueva variable~/* y teclee:
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
    #+NAME: Otra forma chapucera de calcular phat
    #+begin_src hansl 
    series phat3 = 52.351 + 0.139*sqft
    #+end_src
  #+latex: }
  
- =phat2=: Cálculo correcto: \Estmc{\beta_1} + \Estmc{\beta_2} /sqft/

  */~Guardar -> Definir una nueva variable~/* y teclee:
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
    #+NAME: Forma correcta de calcular phat
    #+begin_src hansl 
    series phat4 = $coeff[1] + $coeff[2]*sqft
    #+end_src
  #+latex: }
  o bien:
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
    #+NAME: Otra forma correcta de calcular phat 
    #+begin_src hansl 
    series phat5 = $coeff(const) + $coeff(sqft)*sqft
    #+end_src
  #+latex: }

- Visualice los valores como ya hizo en la Actividad 1 de más arriba. ¿Hay diferencias?
  
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Compare lo cálculos 
    #+begin_src hansl 
    print -o price phat phat2 phat3 phat4 
    #+end_src
  #+latex: }

#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica* ~EjPvivienda.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/EjPvivienda.inp}
#+LATEX: \clearpage

** COMMENT Resultado en Gretl

#+begin_src bash :results file :file EjPviviendaOUTPUT.txt :output-dir ~/gretl/resultados 
  gretlcli -b pub/EjPvivienda.inp 
#+end_src

#+RESULTS:
[[file:~/gretl/resultados/EjPviviendaOUTPUT.txt]]



#+LATEX: \clearpage


* Plano de regresión
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/PlanoRegresion.inp
   :END:

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/PlanoRegresion.inp][PlanoRegresion.inp]] |


- Carga de datos. Abra los menús desplegables: */~Archivo --> Abrir
  datos --> Archivo de muestra~/* y en la pestaña */~POE 4th ed.~/*
  seleccione =andy=.

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black}
  /o bien teclee en linea de comandos/:
  #+NAME: Lectura del fichero de datos
    #+begin_src hansl 
open andy.gdt
    #+end_src
  #+latex: }
  
- Ajuste por MCO las ventas a los precios y gastos en publicidad:
  */~Modelo -> Mínimos Cuadrados Ordinarios~/*; indique a [[https://gretl.sourceforge.net/es.html][Gretl]] el
  regresando y los regresores y pulse */~Aceptar~/*.
  
  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+begin_src hansl
    ols sales 0 price advert
    #+end_src
    (/el cero/ =0= /indica el término constante/: =const=)
  #+latex: }
  
- ``Pinche'' */~Archivo~/* en la ventana del modelo estimado y
  seleccione */~guardar como un icono y cerrar~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: Ajuste MCO que se guarda como icono
    #+begin_src hansl 
    Regresion  <- ols sales 0 price advert
    #+end_src
  #+latex: }

- Observe el /plano de regresión/: abra la ventana del modelo ajustado
  y pinche en */~Gráficos -> Gráfico de variable estimada y observada
  -> Contra price y advert~/*

  #+latex: {\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
    #+begin_src hansl :exports none
    # solo es posible visualizar el plano de regresion con los menus desplegables
    #+end_src
    #+latex: }

#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica* ~PlanoRegresion.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/PlanoRegresion.inp}
#+LATEX: \clearpage


