Practicas/PracticasGretl/pub/Lecc02.tex

\item Mostremos las variables \texttt{price}, \texttt{sqft}, \texttt{phat} y \texttt{ehat}
\label{sec:orgf60eddc}
\begin{itemize}
\item Marque las 4 variables (\texttt{ctrl} y ``pinchar'' con el botón derecho) y elija
\textbf{\emph{\texttt{mostrar valores}}}

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}: 
\begin{verbatim}
print -o price sqft phat ehat
\end{verbatim}
}
\end{itemize}
\end{enumerate}

\subsection{Actividad 5 - Otras formas de recuperar el ajuste}
\label{sec:org3128734}
\begin{itemize}
\item \texttt{phat2}: restar a los precios los errores

Desde la ventana del modelo: \textbf{\emph{\texttt{Guardar -> Definir una nueva
  variable}}} y teclee:
\texttt{phat2 = price - ehat}

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
series phat2 = price - ehat
\end{verbatim}
}

\item \texttt{phat2}: Cálculo \emph{``chapucero''}: 52.351 + 0.139 \emph{sqft}

\textbf{\emph{\texttt{Guardar -> Definir una nueva variable}}} y teclee:
{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\begin{verbatim}
series phat3 = 52.351 + 0.139*sqft
\end{verbatim}
}

\item \texttt{phat2}: Cálculo correcto: \Estmc{\beta_1} + \Estmc{\beta_2} \emph{sqft}

\textbf{\emph{\texttt{Guardar -> Definir una nueva variable}}} y teclee:
{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\begin{verbatim}
series phat4 = $coeff[1] + $coeff[2]*sqft
\end{verbatim}
}
o bien:
{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\begin{verbatim}
series phat5 = $coeff(const) + $coeff(sqft)*sqft
\end{verbatim}
}

\item Visualice los valores como ya hizo en la Actividad 1 de más arriba. ¿Hay diferencias?

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
print -o price phat phat2 phat3 phat4 
\end{verbatim}
}
\end{itemize}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica} \texttt{EjPvivienda.inp}
\vspace{10pt}
\lstinputlisting{scripts/EjPvivienda.inp}
\clearpage

\section{Plano de regresión}
\label{sec:orgbccd1a1}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/PlanoRegresion.inp}{PlanoRegresion.inp}\\[0pt]
\end{tabular}
\end{center}


\begin{itemize}
\item Carga de datos. Abra los menús desplegables: \textbf{\emph{\texttt{Archivo -{}-> Abrir
  datos -{}-> Archivo de muestra}}} y en la pestaña \textbf{\emph{\texttt{POE 4th ed.}}}
seleccione \texttt{andy}.

{\vspace{1pt} \footnotesize \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
open andy.gdt
\end{verbatim}
}

\item Ajuste por MCO las ventas a los precios y gastos en publicidad:
\textbf{\emph{\texttt{Modelo -> Mínimos Cuadrados Ordinarios}}}; indique a \href{https://gretl.sourceforge.net/es.html}{Gretl} el
regresando y los regresores y pulse \textbf{\emph{\texttt{Aceptar}}}.

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
ols sales 0 price advert
\end{verbatim}
(\emph{el cero} \texttt{0} \emph{indica el término constante}: \texttt{const})
}

\item ``Pinche'' \textbf{\emph{\texttt{Archivo}}} en la ventana del modelo estimado y
seleccione \textbf{\emph{\texttt{guardar como un icono y cerrar}}}

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
Regresion  <- ols sales 0 price advert
\end{verbatim}
}

\item Observe el \emph{plano de regresión}: abra la ventana del modelo ajustado
y pinche en \textbf{\emph{\texttt{Gráficos -> Gráfico de variable estimada y observada
  -> Contra price y advert}}}

{\vspace{1pt} \footnotesize \color{gray!70!black} \color{gray!70!black}
}
\end{itemize}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica} \texttt{PlanoRegresion.inp}
\vspace{10pt}
\lstinputlisting{scripts/PlanoRegresion.inp}
\clearpage
