Practicas/PracticasGretl/Lecc02.org
* Simulación del ejemplo del precio de las viviendas con tres regresores
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/SimuladorEjPvivienda.inp
   :END:

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/SimuladorEjPvivienda.inp][SimuladorEjPvivienda.inp]] |
   
En este ejercicio con [[https://gretl.sourceforge.net/es.html][Gretl]] generaremos unos datos simulados para realizar regresiones MCO.

1) Simulamos series de datos de 500 observaciones
  
   + */~Archivo -> Nuevo conjunto de datos~/*, e indicamos el número
     de observaciones: 1500. Marcamos /de sección cruzada/ y
     continuamos adelante. Dejamos sin marcar ~empezar a introducir
     los valores de los datos~ y pulsamos ~Aceptar~.

   + o bien:
     #+begin_src hansl 
   nulldata 1500
     #+end_src

2) Generamos tres variables: =S= con distribución uniforme (35, 120);
   =D= con distribución Chi cuadrado con 5 grados de libertad que
   vamos a multiplicar por 3 y =U= con distribución Normal de media 0
   y desviación típica 40

   + */~Añadir -> Variable aleatoria~/* y se elige para cada
     variable el tipo de distribución, los valores de los parámetros y
     el nombre de la variable

   + o bien
     #+begin_src hansl 
   series S = randgen(U, 35, 120)
   series D = randgen(X, 5) * 3
   series U = randgen(N, 0, 40)
     #+end_src

3) Simulamos los precios según el modelo $\Vect{p} = 300\Vect{1} +
   5\Vect{s} - 2\Vect{d} + \Vect{u}$

   + */~Añadir -> Definir nueva variable~/* y tecleamos: ~P = 300 + 5*S - 2*D + U~

   + O bien 
     #+begin_src hansl
       series P = 300 + 5*S - 2*D + U
     #+end_src

4) Observe los estadísticos de las variables de modelo. En particular,
   ¿son ortogonales =S= y =D= respecto al regresor constante \Vect{1}?

   + */~Ver -> Estadísticos principales~/* con el ratón marcamos =D=,
     =S= y =P=.

   + O bien 
     #+begin_src hansl
       summary P S D
     #+end_src

5) El valor absoluto de la correlación entre =D= y =S= ¿es grande o
   pequeño?

   + */~Ver -> Matriz de correlación~/* y selecciones =D= y =S=.

   + O bien 
     #+begin_src hansl
       corr S D
     #+end_src

6) Observe los diagramas de dispersión de =P= con =S=, el de =P= con
   =D=, y el de los regresores =S= y =D=:

   + */~Ver -> Gráficos -> Gráfico X-Y (Scatter)~/*. Indicamos =S= como ~variable del eje x~. Indicamos =P= como ~variable del eje y~.

   + */~Ver -> Gráficos -> Gráfico X-Y (Scatter)~/*. Indicamos =D= como ~variable del eje x~. Indicamos =P= como ~variable del eje y~.

   + */~Ver -> Gráficos -> Gráfico X-Y (Scatter)~/*. Indicamos =S= como ~variable del eje x~. Indicamos =D= como ~variable del eje y~.

   + O bien 
     #+begin_src hansl
       scaterPS <- gnuplot P S
       scaterPD <- gnuplot P D
       scaterDS <- gnuplot D S
     #+end_src

     Nótese como dichos diagramas reflejan las correlaciones entre las distintas variables del modelo.

7) Ajuste por MCO =P= empleando =S= y =D=:

   + pinche en */~Modelo -> Mínimos Cuadrados Ordinarios~/* y selecciones =D= y =S=.

     - Elija =P= como regresando o "variable dependiente" (marque la opción ~Selección por defecto~).

     - Elija =S= y =D= como regresores o "Variables independientes". Pinche en ~Aceptar~.

     - En la ventana del modelo pinche en */~Archivo -> Guardar como icono y cerrar~/*.

     - Con el botón derecho del ratón, pinche sobre el icono del
       modelo estimado y seleccione ~Añadir a la tabla de modelos~.

   + O bien 
     #+begin_src hansl
       ModeloCompleto <- ols P 0 S D
       modeltab add
     #+end_src

   Observe que el ajuste recupera aproximadamente los valores de los
   parámetros del modelo simulado.

   Observe el /plano de regresión/: abra la ventana del modelo
   ajustado y pinche en */~Gráficos -> Gráfico de variable estimada y
   observada -> Contra S y D~/*

   
  
  - *Tarea adicional* Observe que el papel del parámetro $\beta_1$
    que acompaña al término constante es equilibrar los valores
    medios a ambos lados de la ecuación; es decir, asegurar que
    \[\media{\Vect{p}}=\Estmc{\beta_1}+\Estmc{\beta_2}\media{\Vect{s}}+\Estmc{\beta_3}\media{\Vect{d}}\]
    Verifique que efectivamente
    \[\Estmc{\beta_1}=\media{\Vect{p}}-\Estmc{\beta_2}\media{\Vect{s}}-\Estmc{\beta_3}\media{\Vect{d}}\]

    + Hágalo empleando una calculadora o indique el cálculo en el guión de Gretl con
      #+begin_src hansl	 
	## TAREA ADICIONAL ####
        scalar AjusteMediasC = mean(P) - $coeff(S)*mean(S) - $coeff(D)*mean(D)
        scalar beta1HatC     = $coeff(const)
	######################	 
      #+end_src

      /Otra manera de aludir a los betas estimados es generar una
      matriz columna con los betas: ~beta = $coeff~, de manera que
      ~beta[1,1]~, ~beta[2,1]~ y ~beta[3,1]~ son $\Estmc{\beta_1}$,
      $\Estmc{\beta_2}$ y $\Estmc{\beta_3}$ respectivamente./

** Omisión de regresores       
1) Si se omite el regresor =D= del ajuste ¿qué esperaría que ocurra
   con el parámetro asociado a la cte?

  + pinche en */~Modelo -> Mínimos Cuadrados Ordinarios~/*

    - En la lista de variables dependientes, pinche sobre =D= y pulse la flecha roja para eliminar dicha variable del
      modelo. Pinche en ~Aceptar~.

    - la ventana del modelo pinche en */~Archivo -> Guardar como icono y cerrar~/*.

    - añada este modelo a la ~Tabla de modelos~.

  + O bien 
    #+begin_src hansl
      ModeloSinD <- ols P 0 S
      modeltab add
    #+end_src

  ¿Confirman los resultados lo esperado respecto a los parámetros estimados?

  - *Tarea adicional* Recuerde que el papel del parámetro $\beta_1$
    que acompaña al término constante es equilibrar los valores
    medios a ambos lados de la ecuación; en este caso,
    \[\media{\Vect{p}}=\Estmc{\beta_1}+\Estmc{\beta_2}\media{\Vect{s}}\]
    Verifique que efectivamente
    \[\Estmc{\beta_1}=\media{\Vect{p}}-\Estmc{\beta_2}\media{\Vect{s}}\]

    + Hágalo empleando una calculadora o indique el cálculo en el guión de Gretl con
      #+begin_src hansl	 
        ## TAREA ADICIONAL ####
        scalar AjusteMediasNoD = mean(P) - $coeff(S)*mean(S)
        scalar beta1HatNoD = $coeff(const)
        ######################	 
      #+end_src
       
- Repita el experimento, pero esta vez incluyendo =D= y excluyendo =S=

  + pinche en */~Modelo -> Mínimos Cuadrados Ordinarios~/*

    - Elimine de la lista de regresores la variable =S=, e incluya =D= como regresor. Pinche en ~Aceptar~.

    - la ventana del modelo pinche en */~Archivo -> Guardar como icono y cerrar~/*.

    - añada este modelo a la ~Tabla de modelos~.

  + O bien 
    #+begin_src hansl
      ModeloSinS <- ols P 0 D
      modeltab add
    #+end_src
    donde ~modeltab show~ muestra la tabla de modelos ajustados.

  ¿Confirman los resultados lo esperado respecto a los parámetros estimados?

  + *Tarea adicional* Aquí $\beta_1$ asegura que
    \[\media{\Vect{p}}=\Estmc{\beta_1}+\Estmc{\beta_2}\media{\Vect{d}}\]
    Verifique que efectivamente
    \[\Estmc{\beta_1}=\media{\Vect{p}}-\Estmc{\beta_2}\media{\Vect{d}}\]

    + Hágalo empleando una calculadora o indique el cálculo en el guión de Gretl con
      #+begin_src hansl	 
	## TAREA ADICIONAL ####
        scalar AjusteMediasNoS = mean(P) - $coeff(D)*mean(D)
        scalar beta1HatNoD = $coeff(const)
	######################	 
      #+end_src

