Practicas/PracticasGretl/pub/Lecc02.tex


\section{Simulación del ejemplo del precio de las viviendas con tres regresores}
\label{sec:org431fd69}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/SimuladorEjPvivienda.inp}{SimuladorEjPvivienda.inp}\\[0pt]
\end{tabular}
\end{center}

En este ejercicio con \href{https://gretl.sourceforge.net/es.html}{Gretl} generaremos unos datos simulados para realizar regresiones MCO.

\begin{enumerate}
\item Simulamos series de datos de 500 observaciones

\begin{itemize}
\item \textbf{\emph{\texttt{Archivo -> Nuevo conjunto de datos}}}, e indicamos el número
de observaciones: 1500. Marcamos \emph{de sección cruzada} y
continuamos adelante. Dejamos sin marcar \texttt{empezar a introducir
     los valores de los datos} y pulsamos \texttt{Aceptar}.

\item o bien:
\begin{verbatim}
nulldata 1500
\end{verbatim}
\end{itemize}

\item Generamos tres variables: \texttt{S} con distribución uniforme (35, 120);
\texttt{D} con distribución Chi cuadrado con 5 grados de libertad que
vamos a multiplicar por 3 y \texttt{U} con distribución Normal de media 0
y desviación típica 40

\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Variable aleatoria}}} y se elige para cada
variable el tipo de distribución, los valores de los parámetros y
el nombre de la variable

\item o bien
\begin{verbatim}
series S = randgen(U, 35, 120)
series D = randgen(X, 5) * 3
series U = randgen(N, 0, 40)
\end{verbatim}
\end{itemize}

\item Simulamos los precios según el modelo \(\Vect{p} = 300\Vect{1} +
   5\Vect{s} - 2\Vect{d} + \Vect{u}\)

\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Definir nueva variable}}} y tecleamos: \texttt{P = 300 + 5*S - 2*D + U}

\item O bien 
\begin{verbatim}
series P = 300 + 5*S - 2*D + U
\end{verbatim}
\end{itemize}

\item Observe los estadísticos de las variables de modelo. En particular,
¿son ortogonales \texttt{S} y \texttt{D} respecto al regresor constante \Vect{1}?

\begin{itemize}
\item \textbf{\emph{\texttt{Ver -> Estadísticos principales}}} con el ratón marcamos \texttt{D},
\texttt{S} y \texttt{P}.

\item O bien 
\begin{verbatim}
summary P S D
\end{verbatim}
\end{itemize}

\item El valor absoluto de la correlación entre \texttt{D} y \texttt{S} ¿es grande o
pequeño?

\begin{itemize}
\item \textbf{\emph{\texttt{Ver -> Matriz de correlación}}} y selecciones \texttt{D} y \texttt{S}.

\item O bien 
\begin{verbatim}
corr S D
\end{verbatim}
\end{itemize}

\item Observe los diagramas de dispersión de \texttt{P} con \texttt{S}, el de \texttt{P} con
\texttt{D}, y el de los regresores \texttt{S} y \texttt{D}:

\begin{itemize}
\item \textbf{\emph{\texttt{Ver -> Gráficos -> Gráfico X-Y (Scatter)}}}. Indicamos \texttt{S} como \texttt{variable del eje x}. Indicamos \texttt{P} como \texttt{variable del eje y}.

\item \textbf{\emph{\texttt{Ver -> Gráficos -> Gráfico X-Y (Scatter)}}}. Indicamos \texttt{D} como \texttt{variable del eje x}. Indicamos \texttt{P} como \texttt{variable del eje y}.

\item \textbf{\emph{\texttt{Ver -> Gráficos -> Gráfico X-Y (Scatter)}}}. Indicamos \texttt{S} como \texttt{variable del eje x}. Indicamos \texttt{D} como \texttt{variable del eje y}.

\item O bien 
\begin{verbatim}
scaterPS <- gnuplot P S
scaterPD <- gnuplot P D
scaterDS <- gnuplot D S
\end{verbatim}

Nótese como dichos diagramas reflejan las correlaciones entre las distintas variables del modelo.
\end{itemize}

\item Ajuste por MCO \texttt{P} empleando \texttt{S} y \texttt{D}:

\begin{itemize}
\item pinche en \textbf{\emph{\texttt{Modelo -> Mínimos Cuadrados Ordinarios}}} y selecciones \texttt{D} y \texttt{S}.

\begin{itemize}
\item Elija \texttt{P} como regresando o "variable dependiente" (marque la opción \texttt{Selección por defecto}).

\item Elija \texttt{S} y \texttt{D} como regresores o "Variables independientes". Pinche en \texttt{Aceptar}.

\item En la ventana del modelo pinche en \textbf{\emph{\texttt{Archivo -> Guardar como icono y cerrar}}}.

\item Con el botón derecho del ratón, pinche sobre el icono del
modelo estimado y seleccione \texttt{Añadir a la tabla de modelos}.
\end{itemize}

\item O bien 
\begin{verbatim}
ModeloCompleto <- ols P 0 S D
modeltab add
\end{verbatim}
\end{itemize}

Observe que el ajuste recupera aproximadamente los valores de los
parámetros del modelo simulado.

Observe el \emph{plano de regresión}: abra la ventana del modelo
ajustado y pinche en \textbf{\emph{\texttt{Gráficos -> Gráfico de variable estimada y
   observada -> Contra S y D}}}
\end{enumerate}



\begin{itemize}
\item \textbf{Tarea adicional} Observe que el papel del parámetro \(\beta_1\)
que acompaña al término constante es equilibrar los valores
medios a ambos lados de la ecuación; es decir, asegurar que
\[\media{\Vect{p}}=\Estmc{\beta_1}+\Estmc{\beta_2}\media{\Vect{s}}+\Estmc{\beta_3}\media{\Vect{d}}\]
Verifique que efectivamente
\[\Estmc{\beta_1}=\media{\Vect{p}}-\Estmc{\beta_2}\media{\Vect{s}}-\Estmc{\beta_3}\media{\Vect{d}}\]

\begin{itemize}
\item Hágalo empleando una calculadora o indique el cálculo en el guión de Gretl con
\begin{verbatim}
## TAREA ADICIONAL ####
scalar AjusteMediasC = mean(P) - $coeff(S)*mean(S) - $coeff(D)*mean(D)
scalar beta1HatC     = $coeff(const)
######################	 
\end{verbatim}

\emph{Otra manera de aludir a los betas estimados es generar una
matriz columna con los betas: \texttt{beta = \$coeff}, de manera que
\texttt{beta[1,1]}, \texttt{beta[2,1]} y \texttt{beta[3,1]} son \(\Estmc{\beta_1}\),
\(\Estmc{\beta_2}\) y \(\Estmc{\beta_3}\) respectivamente.}
\end{itemize}
\end{itemize}

\subsection{Omisión de regresores}
\label{sec:orgb0c6c8b}
\begin{enumerate}
\item Si se omite el regresor \texttt{D} del ajuste ¿qué esperaría que ocurra
con el parámetro asociado a la cte?

\begin{itemize}
\item pinche en \textbf{\emph{\texttt{Modelo -> Mínimos Cuadrados Ordinarios}}}

\begin{itemize}
\item En la lista de variables dependientes, pinche sobre \texttt{D} y pulse la flecha roja para eliminar dicha variable del
modelo. Pinche en \texttt{Aceptar}.

\item la ventana del modelo pinche en \textbf{\emph{\texttt{Archivo -> Guardar como icono y cerrar}}}.

\item añada este modelo a la \texttt{Tabla de modelos}.
\end{itemize}

\item O bien 
\begin{verbatim}
ModeloSinD <- ols P 0 S
modeltab add
\end{verbatim}
\end{itemize}

¿Confirman los resultados lo esperado respecto a los parámetros estimados?

\begin{itemize}
\item \textbf{Tarea adicional} Recuerde que el papel del parámetro \(\beta_1\)
que acompaña al término constante es equilibrar los valores
medios a ambos lados de la ecuación; en este caso,
\[\media{\Vect{p}}=\Estmc{\beta_1}+\Estmc{\beta_2}\media{\Vect{s}}\]
Verifique que efectivamente
\[\Estmc{\beta_1}=\media{\Vect{p}}-\Estmc{\beta_2}\media{\Vect{s}}\]

\begin{itemize}
\item Hágalo empleando una calculadora o indique el cálculo en el guión de Gretl con
\begin{verbatim}
## TAREA ADICIONAL ####
scalar AjusteMediasNoD = mean(P) - $coeff(S)*mean(S)
scalar beta1HatNoD = $coeff(const)
######################	 
\end{verbatim}
\end{itemize}
\end{itemize}

\item Repita el experimento, pero esta vez incluyendo \texttt{D} y excluyendo \texttt{S}

\begin{itemize}
\item pinche en \textbf{\emph{\texttt{Modelo -> Mínimos Cuadrados Ordinarios}}}

\begin{itemize}
\item Elimine de la lista de regresores la variable \texttt{S}, e incluya \texttt{D} como regresor. Pinche en \texttt{Aceptar}.

\item la ventana del modelo pinche en \textbf{\emph{\texttt{Archivo -> Guardar como icono y cerrar}}}.

\item añada este modelo a la \texttt{Tabla de modelos}.
\end{itemize}

\item O bien 
\begin{verbatim}
ModeloSinS <- ols P 0 D
modeltab add
\end{verbatim}
donde \texttt{modeltab show} muestra la tabla de modelos ajustados.
\end{itemize}

¿Confirman los resultados lo esperado respecto a los parámetros estimados?

\begin{itemize}
\item \textbf{Tarea adicional} Aquí \(\beta_1\) asegura que
\[\media{\Vect{p}}=\Estmc{\beta_1}+\Estmc{\beta_2}\media{\Vect{d}}\]
Verifique que efectivamente
\[\Estmc{\beta_1}=\media{\Vect{p}}-\Estmc{\beta_2}\media{\Vect{d}}\]

\begin{itemize}
\item Hágalo empleando una calculadora o indique el cálculo en el guión de Gretl con
\begin{verbatim}
