Practicas/PracticasGretl/Lecc02.org
** Proyección omitiendo las constantes       
      
- ¿Y si calculamos la proyección ortogonal de los precios sobre =S=
  y =D= omitiendo la constante? ¿Qué espera que ocurra con los valores medios de =P=
  y del ajuste? Verifique su respuesta con el ordenador.

  + pinche en */~Modelo -> Mínimos Cuadrados Ordinarios~/*

    + Elija =S= y =D= como regresores, pero elimine la constante de la
      lista (/¡algo que jamás debe hacer en sus
      estimaciones!/). Pinche en ~Aceptar~.

    + la ventana del modelo pinche en */~Archivo -> Guardar como icono y cerrar~/*.

    + añada este modelo a la ~Tabla de modelos~.

  + O bien 
    #+begin_src hansl
      ModeloSin1 <- ols P S D
      modeltab add
    #+end_src

  ¿Confirman los resultados lo esperado respecto a los parámetros estimados?

  - *Tarea adicional* Aquí no hay un término constante, así que
    \[\media{\Vect{p}} \ne \Estmc{\beta_1}\media{\Vect{s}} + \Estmc{\beta_2}\media{\Vect{d}}\]
    El equilibro se da añadiendo la media de los errores (que por no
    existir término constante es distinta de cero).  Verifique que
    efectivamente
    \[\media{\Vect{p}} = \Estmc{\beta_1}\media{\Vect{s}} + \Estmc{\beta_2}\media{\Vect{d}} + \media{\res}\]

    + Hágalo empleando una calculadora o indique el cálculo en el guión de Gretl con
      #+begin_src hansl	 
       ## TAREA ADICIONAL ####
       scalar MediaLadoIzdo = mean(P)
       scalar MediaLadoDcho = $coeff(S)*mean(S) + $coeff(D)*mean(D) + mean($uhat)
       ######################	 
      #+end_src
      donde ~$uhat~ son los residuos de la  última regresión realizada.
 
    Este ajuste sin constante, *y que por tanto no debemos llamar
    /regresión MCO/*, no logra equiparar correctamente los valores
    medios de ambos lados de la ecuación. Los únicos elementos
    disponibles para intentar dicho ajuste han sido los vectores de
    datos =S= y =D=, que tienen medias distintas de cero. Pero
    simultáneamente dichos vectores son necesarios para lograr el
    ajuste de las pendientes. Por ello los resultados al omitir la
    constante pueden ser desastrosos.
 
    # Es más, puesto que con cualquiera de los dos regresores es
    # posible de ajustar las medias (si se juega adecuadamente con los
    # betas), esta doble posibilidad se traduce en una mayor
    # incertidumbre en los valores estimados (¿qué variable es más
    # importante para ajustar la media?).

    # Observe en la tabla de modelos cómo han aumentado notablemente
    # las desviaciones típicas de los valores estimados en el modelo
    # sin término constante. Sin embargo, si se fija en los
    # coeficientes de determinación de dicha tabla de modelos, parece
    # que se ha logrado un mejor ajuste. El motivo es que, aunque
    # Gretl indique que calcula el coeficiente de determinación, no es
    # cierto. El programa Gretl realiza un cálculo alternativo cuando
    # el modelo carece de término constante.

    # Calcule los verdaderos coeficientes de determinación y
    # determinación ajustado. Hágalo tecleando las siguientes
    # instrucciones en la consola de Gretl
    # #+begin_src hansl	 
    # 	R2Sin1         = 1 - $ess/(($T-1) * var(P))
    #   R2AjustadoSin1 = 1 - ($T-1)/($T-2)*(1 - R2Sin1)
    # #+end_src

** ``Ortogonalizando'' los regresores no constantes respecto de las constantes
    
1) ¿Hay alguna forma de “ortogonalizar” =S= y =D= respecto de la
   constante?... ¡Si!, basta restar las medias (generar nuevos
   regresores en desviaciones respecto a su media):
   
  + */~Añadir -> Definir nueva variable~/* y escribimos ~series S0 =
    S - mean(S)~
  + */~Añadir -> Definir nueva variable~/* y escribimos ~series D0 =
    D - mean(D)~
  + O bien 
    #+begin_src hansl
      series S0 = S - mean(S)
      series D0 = D - mean(D)
    #+end_src

- Verifique que la media de =S0= y =D0= es cero. Ajuste por MCO los siguientes modelos:
  \[P = \beta_1 + \beta_2 S0 + \beta_3 D0\]
  y
  \[P = \beta_2 S0 + \beta_3 D0\]
  
  Compare los resultados entre ambos y con el modelo completo original.

  #+begin_src hansl
    ModeloCompEnDesviaciones <- ols P 0 S0 D0
    modeltab add
    ModeloEnDesviaciones <- ols P S0 D0
    modeltab add
    modeltab show
  #+end_src

  + Compare la estimación de $\beta_1$ del =ModeloCompEnDesviaciones=
    con la media de =P=.

  + ¿Se le ocurre alguna explicación para este resultado?

  + Observe en la tabla de modelos las similitudes del primer modelo
    en desviaciones con las obtenidas con el modelo completo
    original... ¡Todo es idéntico salvo la estimación de $\beta_1$!

  + Observe que aunque las pendientes estimadas toman los mismos
    valores en ambos modelos en desviaciones, la incertidumbre
    asociada en el caso del modelo en desviaciones sin contante es
    mucho mayor

#+latex: \vspace{10pt}
#+latex: \noindent
*Código completo de la práctica* ~SimuladorEjPvivienda.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/SimuladorEjPvivienda.inp}
#+LATEX: \clearpage


