Practicas/PracticasGretl/pub/Lecc02.tex
## TAREA ADICIONAL ####
scalar AjusteMediasNoS = mean(P) - $coeff(D)*mean(D)
scalar beta1HatNoD = $coeff(const)
######################	 
\end{verbatim}
\end{itemize}
\end{itemize}
\end{enumerate}

\subsection{Proyección omitiendo las constantes}
\label{sec:orge76fe4b}

\begin{itemize}
\item ¿Y si calculamos la proyección ortogonal de los precios sobre \texttt{S}
y \texttt{D} omitiendo la constante? ¿Qué espera que ocurra con los valores medios de \texttt{P}
y del ajuste? Verifique su respuesta con el ordenador.

\begin{itemize}
\item pinche en \textbf{\emph{\texttt{Modelo -> Mínimos Cuadrados Ordinarios}}}

\begin{itemize}
\item Elija \texttt{S} y \texttt{D} como regresores, pero elimine la constante de la
lista (\emph{¡algo que jamás debe hacer en sus
estimaciones!}). Pinche en \texttt{Aceptar}.

\item la ventana del modelo pinche en \textbf{\emph{\texttt{Archivo -> Guardar como icono y cerrar}}}.

\item añada este modelo a la \texttt{Tabla de modelos}.
\end{itemize}

\item O bien 
\begin{verbatim}
ModeloSin1 <- ols P S D
modeltab add
\end{verbatim}
\end{itemize}

¿Confirman los resultados lo esperado respecto a los parámetros estimados?

\begin{itemize}
\item \textbf{Tarea adicional} Aquí no hay un término constante, así que
\[\media{\Vect{p}} \ne \Estmc{\beta_1}\media{\Vect{s}} + \Estmc{\beta_2}\media{\Vect{d}}\]
El equilibro se da añadiendo la media de los errores (que por no
existir término constante es distinta de cero).  Verifique que
efectivamente
\[\media{\Vect{p}} = \Estmc{\beta_1}\media{\Vect{s}} + \Estmc{\beta_2}\media{\Vect{d}} + \media{\res}\]

\begin{itemize}
\item Hágalo empleando una calculadora o indique el cálculo en el guión de Gretl con
\begin{verbatim}
## TAREA ADICIONAL ####
scalar MediaLadoIzdo = mean(P)
scalar MediaLadoDcho = $coeff(S)*mean(S) + $coeff(D)*mean(D) + mean($uhat)
######################	 
\end{verbatim}
donde \texttt{\$uhat} son los residuos de la  última regresión realizada.
\end{itemize}

Este ajuste sin constante, \textbf{y que por tanto no debemos llamar
\emph{regresión MCO}}, no logra equiparar correctamente los valores
medios de ambos lados de la ecuación. Los únicos elementos
disponibles para intentar dicho ajuste han sido los vectores de
datos \texttt{S} y \texttt{D}, que tienen medias distintas de cero. Pero
simultáneamente dichos vectores son necesarios para lograr el
ajuste de las pendientes. Por ello los resultados al omitir la
constante pueden ser desastrosos.
\end{itemize}
\end{itemize}

\subsection{``Ortogonalizando'' los regresores no constantes respecto de las constantes}
\label{sec:orgf0ecda3}

\begin{enumerate}
\item ¿Hay alguna forma de “ortogonalizar” \texttt{S} y \texttt{D} respecto de la
constante?\ldots{} ¡Si!, basta restar las medias (generar nuevos
regresores en desviaciones respecto a su media):

\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Definir nueva variable}}} y escribimos \texttt{series S0 =
    S - mean(S)}
\item \textbf{\emph{\texttt{Añadir -> Definir nueva variable}}} y escribimos \texttt{series D0 =
    D - mean(D)}
\item O bien 
\begin{verbatim}
series S0 = S - mean(S)
series D0 = D - mean(D)
\end{verbatim}
\end{itemize}

\item Verifique que la media de \texttt{S0} y \texttt{D0} es cero. Ajuste por MCO los siguientes modelos:
\[P = \beta_1 + \beta_2 S0 + \beta_3 D0\]
y
\[P = \beta_2 S0 + \beta_3 D0\]

Compare los resultados entre ambos y con el modelo completo original.

\begin{verbatim}
ModeloCompEnDesviaciones <- ols P 0 S0 D0
modeltab add
ModeloEnDesviaciones <- ols P S0 D0
modeltab add
modeltab show
\end{verbatim}

\begin{itemize}
\item Compare la estimación de \(\beta_1\) del \texttt{ModeloCompEnDesviaciones}
con la media de \texttt{P}.

\item ¿Se le ocurre alguna explicación para este resultado?

\item Observe en la tabla de modelos las similitudes del primer modelo
en desviaciones con las obtenidas con el modelo completo
original\ldots{} ¡Todo es idéntico salvo la estimación de \(\beta_1\)!

\item Observe que aunque las pendientes estimadas toman los mismos
valores en ambos modelos en desviaciones, la incertidumbre
asociada en el caso del modelo en desviaciones sin contante es
mucho mayor
\end{itemize}
\end{enumerate}

\vspace{10pt}
\noindent
\textbf{Código completo de la práctica} \texttt{SimuladorEjPvivienda.inp}
\vspace{10pt}
\lstinputlisting{scripts/SimuladorEjPvivienda.inp}
\clearpage
