Practicas/PracticasGretl/Lecc02.org
* Repetición del ejemplo pero introduciendo correlación entre regresores
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/SimuladorEjPvivienda2.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/SimuladorEjPvivienda2.inp][SimuladorEjPvivienda2.inp]] |

En la simulación de la práctica anterior no había una correlación muy
fuerte entre =S= y =D=. En ejemplos reales podemos encontrar una mayor
riqueza de interrelaciones entre regresores.  Para experimentar las
consecuencias, vamos a repetir todo el ejercicio pero introduciendo un
factor común entre =S= y =D= que genere correlación entre ambos
regresores.

- Los datos :: Vamos a variar el modo de generar los datos respecto a la práctica anterior.

  - Genere un factor común =C= con distribución normal de esperanza 40
    y desviación típica 20: */~Añadir -> Definir nueva variable~/* y
    escribimos ~series C = randgen(N, 40, 20)~

  - Genere un vector de datos de superficies con distribución uniforme
    entre 20 y 70 y súmele =C=: */~Añadir
    -> Definir nueva variable~/* y escribimos ~series S = randgen(U, 20, 70) + C~

  - Genere un vector de tiempos de viaje con distribución Chi cuadrado
    con 8 grados de libertad, y súmele 100 y réstele C: */~Añadir ->
    Definir nueva variable~/* y escribimos ~series D = randgen(X, 8) +
    100 - C~

  - Genere un vector de perturbaciones con distribución Normal de
    media 0 y desviación típica 40. */~Añadir -> Definir nueva
    variable~/* y escribimos ~series U = randgen(N, 0, 40)~

  - O bien
    #+NAME: Simulación de regresores S y D con correlación
    #+begin_src hansl
      nulldata 1500
      series C = randgen(N, 40, 20)
      series S = randgen(U, 20, 70) + C
      series D = randgen(X, 8) + 100 - C
      series U = randgen(N, 0, 40)
    #+end_src


-  El modelo :: que de nuevo simulamos es: $\Vect{p} = 300\Vect{1} +
  5\Vect{s} - 2\Vect{d} + \Vect{u}$

  + */~Añadir -> Definir nueva variable~/* y tecleamos: ~P = 300 + 5*S - 2*D + U~

  + O bien 
    #+NAME: Simulación del regresando P
    #+begin_src hansl
      series P = 300 + 5*S - 2*D + U
    #+end_src


- Actividades :: 
  Repita todas las actividades de la práctica anterior pero con estos
  nuevos datos simulados.  Preste especial atención a cuáles son las
  diferencias entre esta simulación y la anterior sin correlación
  entre =S= y =D=.

  Como ya están descritas en la práctica anterior, a continuación tan solo mostrare el guión modificado.
  #+begin_src hansl :exports none
    summary P S D
    
    corr S D
    
    scaterPS <- gnuplot P S
    scaterPD <- gnuplot P D
    scaterDS <- gnuplot D S
    
    ModeloCompleto <- ols P 0 S D
    modeltab add
    
    ## TAREA ADICIONAL ####
    scalar AjusteMediasC = mean(P) - $coeff(S)*mean(S) - $coeff(D)*mean(D)
    scalar beta1HatC     = $coeff(const)
    ######################
    
    ModeloSinD <- ols P 0 S
    modeltab add
    
    ## TAREA ADICIONAL ####
    scalar AjusteMediasNoD = mean(P) - $coeff(S)*mean(S)
    scalar beta1HatNoD = $coeff(const)
    ######################
    
    ModeloSinS <- ols P 0 D
    modeltab add
    
    ## TAREA ADICIONAL ####
    scalar AjusteMediasNoS = mean(P) - $coeff(D)*mean(D)
    scalar beta1HatNoD = $coeff(const)
    ######################
    
    ModeloSin1 <- ols P S D
    modeltab add
    
    ## TAREA ADICIONAL ####
    scalar MediaLadoIzdo = mean(P)
    scalar MediaLadoDcho = $coeff(S)*mean(S) + $coeff(D)*mean(D) + mean($uhat)
    ######################
    
    series S0 = S - mean(S)
    series D0 = D - mean(D)
    
    ModeloCompEnDesviaciones <- ols P 0 S0 D0
    modeltab add
    ModeloEnDesviaciones <- ols P S0 D0
    modeltab add
    modeltab show
  #+end_src

#+LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~SimuladorEjPvivienda2.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/SimuladorEjPvivienda2.inp}
#+LATEX: \clearpage


* Más sobre la ortogonalización de regresores 
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/SimuladorEjPvivienda3.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/SimuladorEjPvivienda3.inp][SimuladorEjPvivienda3.inp]] |
   
En el ejemplo anterior hemos visto que al generar nuevos regresores
=S0= y =P0= que son las componentes de =S= y =P= perpendiculares a las
constantes, y usarlos en sustitución de los regresores originales,
hemos logrado nuevos ajustes en los que incluir u omitir el regresor
constante no cambia el valor de las pendientes estimadas.

** Empleando regresores no constantes que son perpendiculares entre si

Veamos si es posible generalizar este resultado, es decir, si al
emplear como regresor la componente de =S= perpendicular a =P= y la
constante, podemos ajustar =P= con tres regresores perpendiculares
entre sí, de tal manera que omitir cualesquiera de los regresores no
afecta a los parámetros estimados correspondientes a los regresores
que sí se mantienen en el ajuste.

+ Simulamos el modelo de la práctica anterior
#+begin_src hansl :noweb yes
  <<Simulación de regresores S y D con correlación>>
  <<Simulación del regresando P>>
#+end_src

+ Ajustamos los primeros tres modelos de la práctica anterior y los
  guardamos como iconos.
  
#+begin_src hansl :noweb yes
  ModeloCompleto <- ols P 0 S D
  modeltab add    
  ModeloSinD <- ols P 0 S
  modeltab add
  ModeloSinS <- ols P 0 D
  modeltab add
  ModeloSin1 <- ols P S D
  modeltab add
#+end_src

+ El último ajuste es una proyección ortogonal sin término constante
  (no una regresión). Calculemos el coeficiente de determinacion y el
  coeficiente de determinacion ajustado calculando explícitamente su
  fórmula.
  
#+begin_src hansl :noweb yes
  # calculo del coeficiente de determinacion
  scalar R2Sin1 = 1 - $ess/(($T-1) * var(P))
  scalar R2AjustadoSin1 = 1 - ($T-1)/($T-2)*(1 - R2Sin1)
#+end_src

*** Regresiones auxiliares

+ Calculamos la componente de =D= que es ortogonal a los vectores
  constantes y la denominamos =D0=

#+begin_src hansl :noweb yes
  # ortogonalizamos D respecto de las constantes
  series D0 = D - mean(D)
  # o de manera equivalente
  ols D 0 
  series D0 = $uhat

#+end_src

+ Calculamos la componente de =S= que es ortogonal a los vectores
  constantes y a =D= y la denominamos =SpD=

#+begin_src hansl :noweb yes
  # ortogonalizamos S respecto de las constantes y D
  ols S 0 D
  series SpD = $uhat
#+end_src

*** Ajuste de =P= con los nuevos regresores

+ Mediante una regresión ajustamos por MCO =P= a los nuevos regresores

#+begin_src hansl :noweb yes
  ModeloCompleto2   <- ols P 0 SpD D0
  modeltab add
#+end_src

+ Mediante una regresión ajustamos por MCO =P= únicamente al regresor constante

#+begin_src hansl :noweb yes
  ModeloSolo1       <- ols P 0
  modeltab add
#+end_src

+ Mediante una proyección ajustamos =P= a =SpD=

#+begin_src hansl :noweb yes
  ModeloSoloS       <- ols P SpD
  modeltab add
#+end_src

+ Mediante una proyección ajustamos =P= a =D0=

#+begin_src hansl :noweb yes
  ModeloSoloD       <- ols P D0
  modeltab add
#+end_src

+ Compare los resultados de los distintos ajustes: los valores de los
  parámetros y el ajuste medido con el $R^2$ corregido

#+begin_src hansl :noweb yes
  modeltab show
#+end_src

** Ajustes aún más curiosos 
#+begin_src hansl
  ## Dos ajustes curiosos 
#+end_src
En los siguientes ajustes lo que se mantiene es el valor del parámetro
correspondiente la constante del modelo original (aunque no aparezca
explícitamente ningún regresor constante en el ajuste... ahí radica la
curiosidad).

*** Una primera proyección auxiliar
Lo primero es obtener la componente del vector \Vect{1} que es
perpendicular a =S= y a =D= mediante una primera proyección auxiliar
(no la llamaré regresión, pues el espacio sobre el que proyectamos no
contiene los vectores constantes). Llamaré =cte= a dicha componente
(pero obviamente no es un vector constante):
#+begin_src hansl
  ols 0 S D                # proyeccion del vector 1 sobre S y D
  series cte = $uhat       # componente del vector 1 que es perpendicular a S y a D
#+end_src


