Practicas/PracticasGretl/pub/Lecc02.tex


\section{Repetición del ejemplo pero introduciendo correlación entre regresores}
\label{sec:org9331309}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/SimuladorEjPvivienda2.inp}{SimuladorEjPvivienda2.inp}\\[0pt]
\end{tabular}
\end{center}

En la simulación de la práctica anterior no había una correlación muy
fuerte entre \texttt{S} y \texttt{D}. En ejemplos reales podemos encontrar una mayor
riqueza de interrelaciones entre regresores.  Para experimentar las
consecuencias, vamos a repetir todo el ejercicio pero introduciendo un
factor común entre \texttt{S} y \texttt{D} que genere correlación entre ambos
regresores.

\begin{description}
\item[{Los datos}] Vamos a variar el modo de generar los datos respecto a la práctica anterior.

\begin{itemize}
\item Genere un factor común \texttt{C} con distribución normal de esperanza 40
y desviación típica 20: \textbf{\emph{\texttt{Añadir -> Definir nueva variable}}} y
escribimos \texttt{series C = randgen(N, 40, 20)}

\item Genere un vector de datos de superficies con distribución uniforme
entre 20 y 70 y súmele \texttt{C}: \textbf{\emph{\texttt{Añadir
    -> Definir nueva variable}}} y escribimos \texttt{series S = randgen(U, 20, 70) + C}

\item Genere un vector de tiempos de viaje con distribución Chi cuadrado
con 8 grados de libertad, y súmele 100 y réstele C: \textbf{\emph{\texttt{Añadir ->
    Definir nueva variable}}} y escribimos \texttt{series D = randgen(X, 8) +
    100 - C}

\item Genere un vector de perturbaciones con distribución Normal de
media 0 y desviación típica 40. \textbf{\emph{\texttt{Añadir -> Definir nueva
    variable}}} y escribimos \texttt{series U = randgen(N, 0, 40)}

\item O bien
\begin{verbatim}
nulldata 1500
series C = randgen(N, 40, 20)
series S = randgen(U, 20, 70) + C
series D = randgen(X, 8) + 100 - C
series U = randgen(N, 0, 40)
\end{verbatim}
\end{itemize}
\end{description}


\begin{description}
\item[{El modelo}] que de nuevo simulamos es: \(\Vect{p} = 300\Vect{1} +
  5\Vect{s} - 2\Vect{d} + \Vect{u}\)

\begin{itemize}
\item \textbf{\emph{\texttt{Añadir -> Definir nueva variable}}} y tecleamos: \texttt{P = 300 + 5*S - 2*D + U}

\item O bien 
\begin{verbatim}
series P = 300 + 5*S - 2*D + U
\end{verbatim}
\end{itemize}
\end{description}


\begin{description}
\item[{Actividades}] Repita todas las actividades de la práctica anterior pero con estos
nuevos datos simulados.  Preste especial atención a cuáles son las
diferencias entre esta simulación y la anterior sin correlación
entre \texttt{S} y \texttt{D}.

Como ya están descritas en la práctica anterior, a continuación tan solo mostrare el guión modificado.
\end{description}
\clearpage
\noindent
\textbf{Código completo de la práctica} \texttt{SimuladorEjPvivienda2.inp}
\vspace{10pt}
\lstinputlisting{scripts/SimuladorEjPvivienda2.inp}
\clearpage


\section{Más sobre la ortogonalización de regresores}
\label{sec:org35c3827}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/SimuladorEjPvivienda3.inp}{SimuladorEjPvivienda3.inp}\\[0pt]
\end{tabular}
\end{center}

En el ejemplo anterior hemos visto que al generar nuevos regresores
\texttt{S0} y \texttt{P0} que son las componentes de \texttt{S} y \texttt{P} perpendiculares a las
constantes, y usarlos en sustitución de los regresores originales,
hemos logrado nuevos ajustes en los que incluir u omitir el regresor
constante no cambia el valor de las pendientes estimadas.

\subsection{Empleando regresores no constantes que son perpendiculares entre si}
\label{sec:org24a0da6}

Veamos si es posible generalizar este resultado, es decir, si al
emplear como regresor la componente de \texttt{S} perpendicular a \texttt{P} y la
constante, podemos ajustar \texttt{P} con tres regresores perpendiculares
entre sí, de tal manera que omitir cualesquiera de los regresores no
afecta a los parámetros estimados correspondientes a los regresores
que sí se mantienen en el ajuste.

\begin{itemize}
\item Simulamos el modelo de la práctica anterior
\end{itemize}
\begin{verbatim}
nulldata 1500
series C = randgen(N, 40, 20)
series S = randgen(U, 20, 70) + C
series D = randgen(X, 8) + 100 - C
series U = randgen(N, 0, 40)
series P = 300 + 5*S - 2*D + U
\end{verbatim}

\begin{itemize}
\item Ajustamos los primeros tres modelos de la práctica anterior y los
guardamos como iconos.
\end{itemize}

\begin{verbatim}
ModeloCompleto <- ols P 0 S D
modeltab add    
ModeloSinD <- ols P 0 S
modeltab add
ModeloSinS <- ols P 0 D
modeltab add
ModeloSin1 <- ols P S D
modeltab add
\end{verbatim}

\begin{itemize}
\item El último ajuste es una proyección ortogonal sin término constante
(no una regresión). Calculemos el coeficiente de determinacion y el
coeficiente de determinacion ajustado calculando explícitamente su
fórmula.
\end{itemize}

\begin{verbatim}
# calculo del coeficiente de determinacion
scalar R2Sin1 = 1 - $ess/(($T-1) * var(P))
scalar R2AjustadoSin1 = 1 - ($T-1)/($T-2)*(1 - R2Sin1)
\end{verbatim}

\subsubsection{Regresiones auxiliares}
\label{sec:org03f4d08}

\begin{itemize}
\item Calculamos la componente de \texttt{D} que es ortogonal a los vectores
constantes y la denominamos \texttt{D0}
\end{itemize}

\begin{verbatim}
# ortogonalizamos D respecto de las constantes
series D0 = D - mean(D)
# o de manera equivalente
ols D 0 
series D0 = $uhat

\end{verbatim}

\begin{itemize}
\item Calculamos la componente de \texttt{S} que es ortogonal a los vectores
constantes y a \texttt{D} y la denominamos \texttt{SpD}
\end{itemize}

\begin{verbatim}
# ortogonalizamos S respecto de las constantes y D
ols S 0 D
series SpD = $uhat
\end{verbatim}

\subsubsection{Ajuste de \texttt{P} con los nuevos regresores}
\label{sec:org6cdea41}

\begin{itemize}
\item Mediante una regresión ajustamos por MCO \texttt{P} a los nuevos regresores
\end{itemize}

\begin{verbatim}
ModeloCompleto2   <- ols P 0 SpD D0
modeltab add
\end{verbatim}

\begin{itemize}
\item Mediante una regresión ajustamos por MCO \texttt{P} únicamente al regresor constante
\end{itemize}

\begin{verbatim}
ModeloSolo1       <- ols P 0
modeltab add
\end{verbatim}

\begin{itemize}
\item Mediante una proyección ajustamos \texttt{P} a \texttt{SpD}
\end{itemize}

\begin{verbatim}
ModeloSoloS       <- ols P SpD
modeltab add
\end{verbatim}

\begin{itemize}
\item Mediante una proyección ajustamos \texttt{P} a \texttt{D0}
\end{itemize}

\begin{verbatim}
ModeloSoloD       <- ols P D0
modeltab add
\end{verbatim}

\begin{itemize}
\item Compare los resultados de los distintos ajustes: los valores de los
parámetros y el ajuste medido con el \(R^2\) corregido
\end{itemize}

\begin{verbatim}
modeltab show
\end{verbatim}

\subsection{Ajustes aún más curiosos}
\label{sec:org65729cf}
\begin{verbatim}
## Dos ajustes curiosos 
\end{verbatim}
En los siguientes ajustes lo que se mantiene es el valor del parámetro
correspondiente la constante del modelo original (aunque no aparezca
explícitamente ningún regresor constante en el ajuste\ldots{} ahí radica la
curiosidad).

\subsubsection{Una primera proyección auxiliar}
\label{sec:orgd8782c3}
Lo primero es obtener la componente del vector \Vect{1} que es
perpendicular a \texttt{S} y a \texttt{D} mediante una primera proyección auxiliar
(no la llamaré regresión, pues el espacio sobre el que proyectamos no
contiene los vectores constantes). Llamaré \texttt{cte} a dicha componente
(pero obviamente no es un vector constante):
\begin{verbatim}
ols 0 S D                # proyeccion del vector 1 sobre S y D
series cte = $uhat       # componente del vector 1 que es perpendicular a S y a D
\end{verbatim}
