Practicas/PracticasGretl/Lecc02.org
*** Primer ajuste curioso
En una nueva /proyección/ auxiliar obtenemos la componente de =S= que
es perpendicular a =cte= y a =D=, que llamaré =SpD= (componente de =S=
perpendicular a =D= y a =cte=).
#+begin_src hansl
  ##################### Primer ajuste curioso ##################
  ols S cte D
  series SpD = $uhat       # componente de S que es perpendicular a "cte" y a D
#+end_src
Y ahora realizamos la /regresión/ de =P= sobre el mismo subespacio que
en modelo original, pero empleando tres regresores que son ortogonales
entre si, y tales que el parámetro de =cte= es igual al
correspondiente a la constante del modelo original y el de =SpD= al
del parámetro de =S= en la /proyección/ de =P= sobre =S= y =D=
(omitiendo la constante).
#+begin_src hansl
  # regresion MCO que mantiene la pendiente de S del ajuste sin cte
  ModeloCompletoAlternativo1 <- ols P cte SpD D 
  modeltab add 
#+end_src

*** Segundo ajuste curioso
Alternativamente podemos dar los pasos análogos, pero usando la
/proyección/ auxiliar de =D= sobre =cte= y =S=.
#+begin_src hansl
  ##################### Segundo ajuste curioso ##################
  ols D cte S
  series DpS = $uhat       # componente de D que es perpendicular a cte y a S
  ## regresion MCO que mantiene la pendiente de D del ajuste sin cte
  ModeloCompletoAlternativo2 <- ols P cte DpS S 
  modeltab add  
  modeltab show
#+end_src

Compare los resultados en la tabla de modelos.

#+LATEX: \clearpage
#+latex: \noindent
*Código completo de la práctica* ~SimuladorEjPvivienda3.inp~
# +latex: \vspace{10pt}
\lstinputlisting{scripts/SimuladorEjPvivienda3.inp}
#+LATEX: \clearpage
