Practicas/PracticasGretl/pub/Lecc02.tex


\subsubsection{Primer ajuste curioso}
\label{sec:orgdb80fae}
En una nueva \emph{proyección} auxiliar obtenemos la componente de \texttt{S} que
es perpendicular a \texttt{cte} y a \texttt{D}, que llamaré \texttt{SpD} (componente de \texttt{S}
perpendicular a \texttt{D} y a \texttt{cte}).
\begin{verbatim}
##################### Primer ajuste curioso ##################
ols S cte D
series SpD = $uhat       # componente de S que es perpendicular a "cte" y a D
\end{verbatim}
Y ahora realizamos la \emph{regresión} de \texttt{P} sobre el mismo subespacio que
en modelo original, pero empleando tres regresores que son ortogonales
entre si, y tales que el parámetro de \texttt{cte} es igual al
correspondiente a la constante del modelo original y el de \texttt{SpD} al
del parámetro de \texttt{S} en la \emph{proyección} de \texttt{P} sobre \texttt{S} y \texttt{D}
(omitiendo la constante).
\begin{verbatim}
# regresion MCO que mantiene la pendiente de S del ajuste sin cte
ModeloCompletoAlternativo1 <- ols P cte SpD D 
modeltab add 
\end{verbatim}

\subsubsection{Segundo ajuste curioso}
\label{sec:orgb5f934e}
Alternativamente podemos dar los pasos análogos, pero usando la
\emph{proyección} auxiliar de \texttt{D} sobre \texttt{cte} y \texttt{S}.
\begin{verbatim}
##################### Segundo ajuste curioso ##################
ols D cte S
series DpS = $uhat       # componente de D que es perpendicular a cte y a S
## regresion MCO que mantiene la pendiente de D del ajuste sin cte
ModeloCompletoAlternativo2 <- ols P cte DpS S 
modeltab add  
modeltab show
\end{verbatim}

Compare los resultados en la tabla de modelos.

\clearpage
\noindent
\textbf{Código completo de la práctica} \texttt{SimuladorEjPvivienda3.inp}

\lstinputlisting{scripts/SimuladorEjPvivienda3.inp}
\clearpage
\end{document}